In [2]:
import statistics as s

In [3]:
ages=[10,12,12,15,13,22,21,22]

In [4]:
s.mean(ages)

15.875

In [5]:
s.median(ages)

14.0

In [6]:
import pandas as pd

In [7]:
df=pd.DataFrame({"ages":ages})

In [8]:
df

   ages
0    10
1    12
2    12
3    15
4    13
5    22
6    21
7    22

In [9]:
df['ages'].mode()

0    12
1    22
dtype: int64

In [10]:
df_sal = pd.read_csv('SalaryData.csv')

In [14]:
df_sal['salary'].mode()

0      37731
1      39343
2      39891
3      43525
4      46205
5      54445
6      55794
7      56642
8      56957
9      57081
10     57189
11     60150
12     61111
13     63218
14     64445
15     66029
16     67938
17     81363
18     83088
19     91738
20     93940
21     98273
22    101302
23    105582
24    109431
25    112635
26    113812
27    116969
28    121872
29    122391
30    126756
31    127345
32    128765
33    135675
34    139465
dtype: int64